#### [중복데이터 처리]
- 중복 데이터 검사 후 처리 ===> 삭제
- [주의] 중복 데이터를 모두 삭제하는 것은 아님
    * 데이터의 특성을 확인 후 결정 해야 함

In [37]:
# [1] 모듈로딩
import pandas as pd

In [38]:
# [2] 데이터 준비
data=r'C:\Users\KDP-17\EX_PANDAS6\day_04\data.csv'

In [39]:
# [3] DF형태로 저장
df_data=pd.read_csv(data)
df_data

   no     name  age gender
0   1     Hong   10      F
1   2      NaN   25      F
2   3     Jang   63      M
3   4  IronMan  123      F
4   5     CapA  123      M
5   5     CapA  123      M

In [40]:
# [4] 데이터 확인
df_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   no      6 non-null      int64
 1   name    5 non-null      object
 2   age     6 non-null      int64
 3   gender  6 non-null      object
dtypes: int64(2), object(2)
memory usage: 320.0+ bytes

In [41]:
df_data.head(2), df_data.tail(2)

(   no  name  age gender
 0   1  Hong   10      F
 1   2   NaN   25      F,
    no  name  age gender
 4   5  CapA  123      M
 5   5  CapA  123      M)

In [42]:
# [5] 전처리
# [5-1] 결측치 fillna, bfill
df_data.bfill()

   no     name  age gender
0   1     Hong   10      F
1   2     Jang   25      F
2   3     Jang   63      M
3   4  IronMan  123      F
4   5     CapA  123      M
5   5     CapA  123      M

In [43]:
# [5-2] 중복데이터 검사 및 처리
# - keep 매개변수 : 어느 것을 중복 데이터로 취급하지 않을지 설정
#                  (기본값 : first)
df_data.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
dtype: bool

In [44]:
# 중복 데이터 개수 구하기
df_data.duplicated().sum()

1

In [45]:
# 중복 데이터 삭제
df_data.drop_duplicates()

   no     name  age gender
0   1     Hong   10      F
1   2      NaN   25      F
2   3     Jang   63      M
3   4  IronMan  123      F
4   5     CapA  123      M

In [48]:
# 나이 컬럼만 중복 여부 체크
# subset ==> 컬럼 지정
df_data.duplicated(subset='age')

0    False
1    False
2    False
3    False
4     True
5     True
dtype: bool